public/VoidTicketLLSRQ.xml

<SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><m:MessageHeader xmlns:m="http://www.ebxml.org/namespaces/messageHeader">
			<m:From>
				<m:PartyId type="urn:x12.org:IO5:01">http://localhost:8000</m:PartyId>
			</m:From>
			<m:To>
				<m:PartyId type="urn:x12.org:IO5:01">https://webservices.havail.sabre.com</m:PartyId>
			</m:To>
			<m:CPAId>WD4H</m:CPAId>
			<m:ConversationId>V1@pRY8BvflDGigiQ3olCYbm7MqhfcemWIJwNY1hfbY@5abb5d3e9ead0@http://localhost:8000</m:ConversationId>
			<m:Service m:type="OTA">VoidTicketLLSRQ</m:Service>
			<m:Action>VoidTicketLLSRQ</m:Action>
			<m:MessageData>
				<m:MessageId>3610583333448170203</m:MessageId>
				<m:Timestamp>2018-03-28T10:15:44Z</m:Timestamp>
				<m:TimeToLive>2018-03-28T11:15:44Z</m:TimeToLive>
			</m:MessageData>
			<m:DuplicateElimination/>
			<m:Description>VoidTicketLLSRQ</m:Description>
		</m:MessageHeader>
		<wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
			<wsse:BinarySecurityToken valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESC!ICESMSLB\/RES.LB!-3163677827880164210!569058!0</wsse:BinarySecurityToken>
		</wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body><VoidTicketRQ xmlns="http://webservices.sabre.com/sabreXML/2011/10" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" Version="2.0.2">
                  <Ticketing eTicketNumber="123121213" />
                </VoidTicketRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>